<a href="https://colab.research.google.com/github/lukasakar19-byte/Basis-Data/blob/main/Hands_On_Basis_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1) Install dan Jalankan MySQL

In [20]:
!apt-get update
!apt-get install -y mysql-server
!service mysql start

Hit:1 https://cli.github.com/packages stable InRelease
Hit:2 https://cloud.r-project.org/bin/linux/ubuntu jammy-cran40/ InRelease
Hit:3 http://archive.ubuntu.com/ubuntu jammy InRelease
Hit:4 https://r2u.stat.illinois.edu/ubuntu jammy InRelease
Hit:5 http://archive.ubuntu.com/ubuntu jammy-updates InRelease
Hit:6 http://security.ubuntu.com/ubuntu jammy-security InRelease
Hit:7 https://ppa.launchpadcontent.net/deadsnakes/ppa/ubuntu jammy InRelease
Hit:8 http://archive.ubuntu.com/ubuntu jammy-backports InRelease
Hit:9 https://ppa.launchpadcontent.net/ubuntugis/ppa/ubuntu jammy InRelease
Reading package lists... Done
W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Reading package lists... Done
Building dependency tree... Done
Reading state information... Done
mysql-server is already the newest version (8.0.45-0ubuntu0.22.04.1).
0 upgraded, 0 newly installed, 0 to remove and 103 not upgraded.
 * Starting MySQL database server mysqld
   ...done.

2) Cek MySQL Sudah Aktif

In [21]:
!mysql -u root -e "SELECT VERSION();"

+-------------------------+
| VERSION()               |
+-------------------------+
| 8.0.45-0ubuntu0.22.04.1 |
+-------------------------+

3) CREATE DATABASE

In [22]:
!mysql -u root -e "CREATE DATABASE latihan_db;"

ERROR 1007 (HY000) at line 1: Can't create database 'latihan_db'; database exists

4) SHOW DATABASE

In [23]:
!mysql -u root -e "SHOW DATABASES;"

+--------------------+
| Database           |
+--------------------+
| information_schema |
| latihan_db         |
| mysql              |
| performance_schema |
| produk_db          |
| sys                |
+--------------------+

5) CREATE DATABASE

In [24]:
!mysql -u root -D latihan_db -e "CREATE TABLE produk (id INT PRIMARY KEY, nama_produk VARCHAR(50), kategori VARCHAR(30), harga INT);"

#Menampilkan daftar tabel
!mysql -u root -D latihan_db -e "SHOW TABLES;"

#Menampilkan struktur tabel siswa
!mysql -u root -D latihan_db -e "DESCRIBE produk;"

+----------------------+
| Tables_in_latihan_db |
+----------------------+
| produk               |
+----------------------+
+-------------+-------------+------+-----+---------+-------+
| Field       | Type        | Null | Key | Default | Extra |
+-------------+-------------+------+-----+---------+-------+
| id          | int         | NO   | PRI | NULL    |       |
| nama_produk | varchar(50) | YES  |     | NULL    |       |
| kategori    | varchar(30) | YES  |     | NULL    |       |
| harga       | int         | YES  |     | NULL    |       |
+-------------+-------------+------+-----+---------+-------+

6) INSERT INTO

In [25]:
!mysql -u root -D latihan_db -e "INSERT INTO produk (id, nama_produk, kategori, harga) VALUES (1, 'Laptop Asus', 'Elektronik', 8500000), (2, 'Mouse Logitech', 'Aksesoris', 150000), (3, 'Meja Belajar', 'Furniture', 1200000);"

7) SELECT

In [26]:
!mysql -u root -D latihan_db -e "SELECT * FROM produk;"

+----+----------------+------------+---------+
| id | nama_produk    | kategori   | harga   |
+----+----------------+------------+---------+
|  1 | Laptop Asus    | Elektronik | 8500000 |
|  2 | Mouse Logitech | Aksesoris  |  150000 |
|  3 | Meja Belajar   | Furniture  | 1200000 |
+----+----------------+------------+---------+

8) UPDATE

In [27]:
!mysql -u root -D latihan_db -e "UPDATE produk SET harga = 9000000 WHERE id = 1;"

!mysql -u root -D latihan_db -e "SELECT * FROM produk WHERE id = 1;"

+----+-------------+------------+---------+
| id | nama_produk | kategori   | harga   |
+----+-------------+------------+---------+
|  1 | Laptop Asus | Elektronik | 9000000 |
+----+-------------+------------+---------+

9) DELETE

In [28]:
!mysql -u root -D latihan_db -e "DELETE FROM produk WHERE id = 2;"

!mysql -u root -D latihan_db -e "SELECT * FROM produk;"

+----+--------------+------------+---------+
| id | nama_produk  | kategori   | harga   |
+----+--------------+------------+---------+
|  1 | Laptop Asus  | Elektronik | 9000000 |
|  3 | Meja Belajar | Furniture  | 1200000 |
+----+--------------+------------+---------+

MERESET ULANG DATA DAN INPUT KEMBALI

In [29]:
!mysql -u root -D latihan_db -e "TRUNCATE TABLE produk;"
#Input Kembali
!mysql -u root -D latihan_db -e "INSERT INTO produk (id, nama_produk, kategori, harga) VALUES (1, 'HP Samsung', 'Elektronik', 3500000), (2, 'Kursi Kantor', 'Furniture', 750000), (3, 'Flashdisk 64GB', 'Aksesoris', 80000);"